Revit 2027 API
ParameterTypeId.FamilyStructMaterialType Property
 "Material for Model Behavior"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyStructMaterialType { get; }
Public Shared ReadOnly Property FamilyStructMaterialType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyStructMaterialType {
	ForgeTypeId^ get ();
}
static member FamilyStructMaterialType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace